//1.
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//
//
//#include<stdio.h>
//
//int main()
//{
//	int A, B, C, D, E;
//
//	for (A = 1; A < 6; A++)
//	{
//		for (B = 1; B < 6; B++)
//		{
//			for (C = 1; C < 6; C++)
//			{
//				for (D = 1; D < 6; D++)
//				{
//					E = 15 - A - B - C - D;
//					if (((B == 2) + (A == 3)) == 1 &&
//						((B == 2) + (E == 4)) == 1 && 
//						((C == 1) + (D == 2)) == 1 && 
//						((C == 5) + (D == 3)) == 1 && 
//						((E == 4) + (A == 1)) == 1)
//					{
//						if ((A*B*C*D*E==120)&&(A+B+C+D+E==15))
//						{
//							printf("%d %d %d %d %d\n", A, B, C, D, E);
//						}
//						
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}

//2.
//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。以下为4个嫌疑犯的供词。
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。
//
//#include<stdio.h>
//
//int main()
//{
//	int A, B, C, D;
//
//	for (A = 0; A < 2; A++)
//	{
//		for (B = 0; B < 2; B++)
//		{
//			for (C = 0; C < 2; C++)
//			{
//				for (D = 0; D < 2; D++)
//				{
//					
//					if ((A == 0) + (C == 1) + (D == 1) + (D != 1) == 3)
//					{
//						if(A+B+C+D==1)
//						printf("%d %d %d %d\n", A, B, C, D);
//						
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}

//3.在屏幕上打印杨辉三角。
//1
//1 1
//1 2 1
//1 3 3 1
//1 4 6 4 1

#include<stdio.h>

int main()
{
	char arr[5][5];
	int i = 0, j = 0;
	int m = 5, n = 5;//行，列

	for (i = 0; i < m; i++)
	{
		for (j = 0; j < n; j++)
			arr[i][j] = 0;
	}
	for (i = 0; i < m; i++)
	{
		arr[i][i] = 1;
		arr[i][0] = 1;
	}
	for (i = 2; i < m; i++)
	{
		for (j = 1; j < n-1; j++)
		{
			arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
		}
	}
	for (i = 0; i < m; i++)
	{
		for (j = 0; j < n; j++)
			printf("%d  ", arr[i][j]);
		printf("\n");
	}
		
	return 0;
}